In [1]:
import pandas as pd

In [2]:
'11 12 13 14'.split()

['11', '12', '13', '14']

In [4]:
data = [(1,2,3,4),
        (5,6,7,8),
        (8,10,11,12),
        (13,14,15,16)]
df = pd.DataFrame(data,'11 12 13 14'.split(),'c1 c2 c3 c4'.split())

In [5]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   8  10  11  12
14  13  14  15  16

In [6]:
df['c1']

11     1
12     5
13     8
14    13
Name: c1, dtype: int64

In [7]:
type(df['c1'])

pandas.core.series.Series

In [8]:
df[['c3','c1']]

    c3  c1
11   3   1
12   7   5
13  11   8
14  15  13

In [9]:
type(df[['c3','c1']])

pandas.core.frame.DataFrame

In [13]:
df[:]

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   8  10  11  12
14  13  14  15  16

In [14]:
df[1:]

    c1  c2  c3  c4
12   5   6   7   8
13   8  10  11  12
14  13  14  15  16

In [15]:
df[1:3]

    c1  c2  c3  c4
12   5   6   7   8
13   8  10  11  12

In [16]:
df[1:2]

    c1  c2  c3  c4
12   5   6   7   8

In [19]:
df[1:][['c3','c1']]

    c3  c1
12   7   5
13  11   8
14  15  13

In [20]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   8  10  11  12
14  13  14  15  16

In [21]:
df.loc['13']

c1     8
c2    10
c3    11
c4    12
Name: 13, dtype: int64

In [22]:
df.loc[['13','12']]

    c1  c2  c3  c4
13   8  10  11  12
12   5   6   7   8

In [23]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   8  10  11  12
14  13  14  15  16

In [25]:
df.loc['11','c2']

2

In [26]:
df.iloc[0,1]

2

In [28]:
df.loc[['13','11'], ['c4','c1']]

    c4  c1
13  12   8
11   4   1

In [29]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   8  10  11  12
14  13  14  15  16

In [30]:
df.iloc[[2,0],[3,0]]

    c4  c1
13  12   8
11   4   1